Repository: Programista-Art/Avocado
Catalog: languages/IDE Avocado.ua.po
Languages: ua

source: Błędna składnia funkcji wstaw. Oczekiwano: wstaw(source, target, index)
ua: Неправильний синтаксис функції вставки. Очікується: insert(джерело, ціль, індекс)

source: Funkcja wstaw wymaga trzech argumentów: source, target, index
ua: Функція вставки вимагає три аргументи: джерело, ціль, індекс

source: Błędna składnia funkcji przytnij. Oczekiwano: przytnij(s)
ua: Неправильний синтаксис функції trim. Очікуване: trim(s)

source: Błędna składnia funkcji przytnij_z_lewa. Oczekiwano: przytnij_z_lewa(s)
ua: Неправильний синтаксис функції trim_with_left. Очікуване: trim_from_left(s)

source: Błędna składnia funkcji przytnij_z_prawa. Oczekiwano: przytnij_z_prawa(s)
ua: Неправильний синтаксис функції trim_with_right. Очікується: trim_from_right(s)

source: Nieprawidłowa deklaracja zmiennej:
ua: Неправильне оголошення змінної:

source: Informacja o IDE Avocado
ua: Інформація про середовище розробки Avocado

# tformautor.caption
source: Autor
ua: Автор

source: Pomocnik AI
ua: Помічник штучного інтелекту

source: Wpisz zapytanie
ua: Введіть свій запит

# tformmain.kompiluj.caption
source: Kompiluj
ua: Компіляція

source: Debug
ua: Налагодження

source: Informacja
ua: Інформація

source: Rozmiar
ua: Розмір

# tformmain.menuaboutprogram.caption
source: O programie
ua: Про програму

# tformmain.menuautor.caption
source: Autor
ua: Автор

source: Przykłady
ua: Приклади

source: Informacja o IDE
ua: Інформація про IDE

source: Plik
ua: Файл

# tformmain.menuitem2.caption
source: Ustawienia
ua: Налаштування

source: Pomoc
ua: Допоможіть!

source: Usuń
ua: Видалити

source: Ustawienia pomocnika AI
ua: Налаштування помічника ШІ

# tformmain.menuitem5.caption
source: Kopiuj
ua: Копіювати

# tformmain.menuitem6.caption
source: Kopiuj wszystko
ua: Копіювати все

source: Sprawdź kod [AI]
ua: Перевірте код [AI].

source: Język
ua: Мова

# tformmain.menuitemcopy.caption
source: Kopiuj
ua: Копіювати

# tformmain.menuitemcopyallpascalzcode.caption
source: Kopiuj wszystko
ua: Зрозуміло.

# tformmain.menuitemcopycode.caption
source: Kopiuj
ua: Копіювати

# tformmain.menuitemcopypascalcode.caption
source: Kopiuj
ua: Копіювати

# tformmain.menuitemcut.caption
source: Wytnij
ua: Вирізати

# tformmain.menuitemcutcode.caption
source: Wytnij
ua: Вирізати.

source: čeština
ua: Чеська

source: Usuń kod
ua: Видалити код

source: Usuń kod
ua: Видалити код

# tformmain.menuitemdeletememologs.caption
source: Usuń
ua: Видалити

source: Dokumentacja online
ua: Документація онлайн

# tformmain.menuitemoutputcodeclear.caption
source: Usuń
ua: Видалити

# tformmain.menuitempaste.caption
source: Wklej
ua: Вставити

# tformmain.menuitempastecode.caption
source: Wklej
ua: Вставити

source: Wesprzyj
ua: Підтримка

source: Nowy
ua: Новий

source: Opcje projektu
ua: Варіанти дизайну

source: Otwórz
ua: Відчинено

source: Projekt
ua: Проект

source: Zapisz jak
ua: Запишіть, як

source: NowyPLik
ua: NewPLik

source: Nowy Plik
ua: Новий файл

source: Panel4
ua: Панель 4

source: Transpilacja do Free Pascal
ua: Трансляція на Free Pascal

source: ToolBar1
ua: Панель інструментів1

# tformmain.toolbutton1.hint
source: Transpiluj
ua: Транспіле

source: Kompiluj i zapisz
ua: Складіть і збережіть

# tformmain.toolbutton2.hint
source: Kompiluj
ua: Скомпілювати

# tformmain.transpiluj.caption
source: Transpiluj
ua: Транспіле

source: ZapiszPlik
ua: SaveFile

source: Opcje Projektu
ua: Варіанти проекту

# tformoprogramie.caption
source: O programie
ua: Про програму

# tformoprogramie.panel1.caption
source: Panel1
ua: Панель1

source: Przyklady aplikacji
ua: Приклади застосування

# tformsettingintepreter.bitbtn1.caption
source: Ok
ua: Гаразд.

# tformsettingintepreter.caption
source: Ustawienia
ua: Налаштування

source: Platforma
ua: Платформа

source: LInk do fpc.exe
ua: Посилання на fpc.exe

source: Link do folderu FPC
ua: Посилання на папку FPC

source: Ustawienia Pomocnika AI
ua: Налаштування помічника ШІ

source: Model językowy
ua: Мовна модель

source: Klucz API
ua: Ключ API

# tsettingai.menuitemcopy.caption
source: Kopiuj
ua: Зрозумів.

# tsettingai.menuitemdelete.caption
source: Usuń
ua: Видалити

source: Ukryj klucz
ua: Приховати ключ

source: Wstaw
ua: Вставити

source: Pokaż klucz
ua: Показати ключ

# tsettingai.speedbutsave.caption
source: Zapisz
ua: Зберегти

source: Anuluj
ua: Оголосити

source: Wsparcie
ua: Підтримка

# twsparcie.speedbutton1.caption
source: OK
ua: ГАРАЗД.

source: Wesprzyj projekt
ua: Підтримайте проект

source: Znaków
ua: Знаки

source: Linii Kodu
ua: Кодові рядки

source: Podaj nazwę programu:
ua: Введіть назву програми:

source: Nowy plik
ua: Новий файл

source: Otwarty projekt:
ua: Відкритий проект:
