Repository: Programista-Art/Avocado
Catalog: languages/IDE Avocado.cz.po
Languages: cz

source: Incorrect syntax of the insert function. Expected: insert(source, target, index)
cz: Nesprávná syntaxe funkce insert. Očekávané: insert(source, target, index)

source: The insert function requires three arguments: source, target, index.
cz: Funkce insert vyžaduje tři argumenty: zdroj, cíl, index.

source: Incorrect syntax of the trim function. Expected: trim(s)
cz: Nesprávná syntaxe funkce trim. Očekávané: trim(s)

source: Incorrect syntax of the function trim_from_left. Expected: trim_left(s)
cz: Nesprávná syntaxe funkce trim_left. Očekávané: trim_left(s)

source: Incorrect syntax of the trim_right function. Expected: trim_right(s)
cz: Nesprávná syntaxe funkce trim_right. Očekávané: trim_right(s)

source: Incorrect variable declaration:
cz: Nesprávná deklarace proměnné:

source: Unknown file variable type:
cz: Neznámý typ proměnné souboru:

source: Informacja o IDE Avocado
cz: Informace o avokádu IDE

source: Pomocnik AI
cz: Pomocník AI

source: Wpisz zapytanie
cz: Zadejte svůj dotaz

# tformmain.kompiluj.caption
source: Kompiluj
cz: Kompilace

source: Debug
cz: Ladění

source: Informacja
cz: Informace

source: Rozmiar
cz: Velikost

# tformmain.menuaboutprogram.caption
source: O programie
cz: O programu

source: Zamknij
cz: Zavřít

source: Przykłady
cz: Příklady

source: Informacja o IDE
cz: Informace o IDE

source: Plik
cz: Soubor

# tformmain.menuitem2.caption
source: Ustawienia
cz: Nastavení

source: Pomoc
cz: Nápověda

source: Usuń
cz: Vymazat

source: Ustawienia pomocnika AI
cz: Nastavení pomocníka AI

# tformmain.menuitem5.caption
source: Kopiuj
cz: Kopírovat

# tformmain.menuitem6.caption
source: Kopiuj wszystko
cz: Kopírovat vše

source: Sprawdź kod [AI]
cz: Zkontrolujte kód [AI]

source: Język
cz: Language

# tformmain.menuitemcopy.caption
source: Kopiuj
cz: Kopírovat

# tformmain.menuitemcopyallpascalzcode.caption
source: Kopiuj wszystko
cz: Kopírovat vše

# tformmain.menuitemcopycode.caption
source: Kopiuj
cz: Kopírovat

# tformmain.menuitemcopypascalcode.caption
source: Kopiuj
cz: Kopírovat

# tformmain.menuitemcut.caption
source: Wytnij
cz: Vystřihněte

# tformmain.menuitemcutcode.caption
source: Wytnij
cz: Vystřihněte

# tformmain.menuitemdeletecode.caption
source: Usuń kod
cz: Odstranit kód

# tformmain.menuitemdeletememologs.caption
source: Usuń
cz: Odstranit

source: Dokumentacja online
cz: Online dokumentace

# tformmain.menuitemoutputcodeclear.caption
source: Usuń
cz: Odstranit

# tformmain.menuitempaste.caption
source: Wklej
cz: Vložit

# tformmain.menuitempastecode.caption
source: Wklej
cz: Vložit

# tformmain.menuitemsavefile.caption
source: Zapisz
cz: Uložit

source: Wesprzyj
cz: Podpora

source: Nowy
cz: Nový

source: Opcje projektu
cz: Možnosti designu

source: Otwórz
cz: Otevřít

source: Zapisz jak
cz: Napište si, jak

# tformmain.menuustawinia.caption
source: Ustawienia
cz: Nastavení

source: NowyPLik
cz: NewPLik

source: Nowy Plik
cz: Nový soubor

source: Transpilacja do Free Pascal
cz: Transpilace do jazyka Free Pascal

source: ToolBar1
cz: Panel nástrojů1

# tformmain.toolbutton1.hint
source: Transpiluj
cz: Transpile

source: Kompiluj i zapisz
cz: Zkompilovat a uložit

# tformmain.toolbutton2.hint
source: Kompiluj
cz: Kompilace

# tformmain.transpiluj.caption
source: Transpiluj
cz: Transpile

source: ZapiszPlik
cz: SaveFile

source: Opcje Projektu
cz: Možnosti projektu

# tformoprogramie.caption
source: O programie
cz: O programu

source: Przyklady aplikacji
cz: Příklady aplikací

# tformsettingintepreter.caption
source: Ustawienia
cz: Nastavení

source: LInk do fpc.exe
cz: fpc.exe odkaz

source: Link do folderu FPC
cz: Odkaz do složky FPC

source: Ustawienia Pomocnika AI
cz: Nastavení pomocníka AI

source: Model językowy
cz: Jazykový model

source: Klucz API
cz: Klíč API

# tsettingai.menuitemcopy.caption
source: Kopiuj
cz: Kopírovat

# tsettingai.menuitemdelete.caption
source: Usuń
cz: Odstranit

source: Ukryj klucz
cz: Skrytí klíče

source: Wstaw
cz: Vložte

source: Pokaż klucz
cz: Zobrazit klíč

# tsettingai.speedbutsave.caption
source: Zapisz
cz: Uložit

source: Anuluj
cz: Annouce

source: Wsparcie
cz: Podpora

source: Wesprzyj projekt
cz: Podpora projektu

source: Znaków
cz: Značky

source: Linii Kodu
cz: Řádky kódu

source: Podaj nazwę programu:
cz: Zadejte název programu:

source: Nowy plik
cz: Nový soubor

source: Otwarty projekt:
cz: Otevřený projekt:
