Repository: Programista-Art/Avocado
Catalog: languages/IDE Avocado.*.po
Languages: ar, de, es, fr, hi, it, jp, lt, ro, ru, sv, tr, zh

source: Incorrect syntax of the insert function. Expected: insert(source, target, index)
ru: Неверная синтаксис функции insert. Ожидалось: insert(source, target, index)

source: The insert function requires three arguments: source, target, index.
ru: Функция insert требует трех аргументов: source, target, index

source: Incorrect syntax of the trim function. Expected: trim(s)
ru: Неверная синтаксис функции trim. Ожидалось: trim(s)

source: Incorrect syntax of the function trim_from_left. Expected: trim_left(s)
ru: Неверная синтаксис функции trim_left. Ожидалось: trim_left(s)

source: Incorrect syntax of the trim_right function. Expected: trim_right(s)
ru: Неверная синтаксис функции trim_right. Ожидалось: trim_right.(s)

source: Incorrect variable declaration:
ru: Неправильное объявление переменной:

source: Unknown file variable type:
ru: Неизвестный тип файловой переменной:

source: Unknown variable type:
ru: Неизвестный тип переменной:

source: AI Helper
ru: ИИ-помощник

# taiassistant.editaskpromt.texthint
source: Wpisz zapytanie
ru: Введите запрос

# taiassistant.menuitemcopyallpascalzcode.caption
source: Kopiuj wszystko
ru: Копировать все

# taiassistant.menuitemcopypascalcode.caption
source: Kopiuj
ru: Копировать

# taiassistant.menuitemoutputcodeclear.caption
source: Usuń
ru: Удалить

source: Information about the Avocado IDE
ru: Информация об IDE Avocado

# tfinformacjaide.speedbutton1.caption
source: OK
ar: حسناً
hi: ठीक है
jp: オッケー
lt: GERAI
ru: ОК
tr: TAMAM

# tformautor.caption
source: Author
ru: Автор

# tformautor.speedbutton1.caption
source: Ok
ar: حسناً
hi: ठीक है
jp: オッケー
lt: Gerai
ro: Bine
ru: Ок
tr: Tamam

# tformmain.butcompilecode.caption
source: Kompiluj i zapisz
ru: Скомпилируйте и сохраните

# tformmain.butcompilecode.hint
source: Kompiluj
ru: Компилировать

source: Tools
ru: Инструменты

# tformmain.kompiluj.caption
source: Kompiluj
ar: تجميع
de: Kompilieren
es: Compilar
fr: Compiler
hi: संकलन
it: Compila
jp: コンパイル
lt: Kompiliuoti
ro: Compilare
ru: Компилировать
sv: Kompilera
tr: Derleme
zh: 编译

source: Debug
ar: تصحيح الأخطاء
de: Debuggen
es: Depuración
fr: Débogage
hi: डिबग
jp: デバッグ
lt: Derinimas
ro: Depanare
ru: Отладка
sv: Felsökning
tr: Hata Ayıklama
zh: 调试

source: Rozmiar
ar: الحجم
de: Größe
es: Tamaño
fr: Taille
hi: आकार
it: Dimensioni
jp: サイズ
lt: Dydis
ro: Mărime
ru: Размер
sv: Storlek
tr: Boyut
zh: 尺寸

# tformmain.menuaboutprogram.caption
source: O programie
ar: حول البرنامج
de: Über das Programm
es: Acerca del programa
fr: À propos du programme
hi: कार्यक्रम के बारे में
it: Il programma
jp: プログラムについて
lt: Apie programą
ro: Despre program
ru: О программе
sv: Om programmet
tr: Program hakkında
zh: 关于该计划

# tformmain.menuautor.caption
source: Autor
ar: المؤلف
fr: Auteur
hi: लेखक
it: Autore
jp: 著者
lt: Autorius
ru: Автор
sv: Författaren
tr: Yazar
zh: 作者

source: Zamknij
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
hi: बंद करना
it: Chiudi
jp: 閉じる
lt: Uždaryti
ro: Închidere
ru: Закрыть
sv: Nära
tr: Kapat
zh: 关闭

source: Przykłady
ar: أمثلة
de: Beispiele
es: Ejemplos
fr: Exemples
hi: उदाहरण
it: Esempi
jp: 例
lt: Pavyzdžiai
ro: Exemple
ru: Примеры
sv: Exempel
tr: Örnekler
zh: 示例

source: Informacja o IDE
ar: معلومات عن IDE
de: Informationen zu IDE
es: Información sobre el IDE
fr: Informations sur l'IDE
hi: IDE के बारे में जानकारी
it: Informazioni sull'IDE
jp: IDEに関する情報
lt: Informacija apie IDE
ro: Informații privind IDE
ru: Информация об IDE
sv: Information om IDE
tr: IDE hakkında bilgi
zh: 关于IDE的信息

source: AI Assistant
ru: Помощник ИИ

source: Plik
ar: ملف
de: Datei
es: Archivo
fr: Fichier
hi: फ़ाइल
it: File
jp: ファイル
lt: Failas
ro: Fișier
ru: Файл
sv: Fil
tr: Dosya
zh: 文件

# tformmain.menuitem19.caption
source: Theme
ru: Тема

# tformmain.menuitem2.caption
source: Settings
ru: Настройки

source: Pomoc
ar: مساعدة
de: Hilfe
es: Ayuda
fr: Aide
hi: मदद
it: Aiuto
jp: ヘルプ
lt: Pagalba
ro: Ajutor
ru: Помощь
sv: Hjälp
tr: Yardım
zh: 帮助

source: Usuń
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
hi: मिटाना
it: Elimina
jp: 消去
lt: Ištrinti
ro: Șterge
ru: Удалить
sv: Ta bort
tr: Sil
zh: 删除

source: AI Helper Settings
ru: Настройки помощника AI

# tformmain.menuitem5.caption
source: Kopiuj
ar: نسخ
de: Kopieren
es: Copiar
fr: Copier
hi: प्रतिलिपि
it: Copia
jp: コピー
lt: Kopijuoti
ro: Copiați
ru: Копировать
sv: Kopia
tr: Anlaşıldı
zh: 复制

# tformmain.menuitem6.caption
source: Kopiuj wszystko
ar: انسخ كل شيء
de: Alles kopieren
es: Copiar todo
fr: Tout copier
hi: सभी को कॉपी करें
it: Copia tutto
jp: すべてコピー
lt: Kopijuoti visus
ro: Copiați toate
ru: Копировать все
sv: Kopiera alla
tr: Tümünü kopyala
zh: 复制全部

source: Sprawdź kod [AI]
ar: تحقق من الرمز [AI]
de: Code überprüfen [AI]
es: Comprueba el código [AI]
fr: Vérifiez le code [AI]
hi: कोड जांचें [AI]
it: Controlla il codice [AI]
jp: チェックコード[AI]。
lt: Patikrinkite kodą [AI].
ro: Verificați codul [AI].
ru: Проверить код [AI]
sv: Kontrollera kod [AI].
tr: AI] kodunu kontrol edin.
zh: 检查代码 [AI]

source: Język
ar: اللغة
de: Sprache
es: Idioma
fr: Langue
hi: जीभ
it: Lingua
jp: Language
lt: Language
ro: Language
ru: Language
sv: Language
tr: Language
zh: 语言

# tformmain.menuitemcopy.caption
source: Kopiuj
ar: نسخ
de: Kopieren
es: Copiar
fr: Copier
hi: प्रतिलिपि
it: Copia
jp: コピー
lt: Kopijuoti
ro: Copiați
ru: Копировать
sv: Kopia
tr: Anlaşıldı
zh: 复制

# tformmain.menuitemcopyallpascalzcode.caption
source: Kopiuj wszystko
ar: انسخ كل شيء
de: Alles kopieren
es: Copiar todo
fr: Tout copier
hi: सभी को कॉपी करें
it: Copia tutto
jp: すべてコピー
lt: Kopijuoti visus
ro: Copiați toate
ru: Копировать все
sv: Kopiera alla
tr: Tümünü kopyala
zh: 复制全部

# tformmain.menuitemcopycode.caption
source: Kopiuj
ar: نسخ
de: Kopieren
es: Copiar
fr: Copier
hi: प्रतिलिपि
it: Copia
jp: コピー
lt: Kopijuoti
ro: Copiați
ru: Копировать
sv: Kopia
tr: Anlaşıldı
zh: 复制

# tformmain.menuitemcopypascalcode.caption
source: Kopiuj
ar: نسخ
de: Kopieren
es: Copiar
fr: Copier
hi: प्रतिलिपि
it: Copia
jp: コピー
lt: Kopijuoti
ro: Copiați
ru: Копировать
sv: Kopia
tr: Anlaşıldı
zh: 复制

# tformmain.menuitemcut.caption
source: Wytnij
ar: قطع
de: Ausschneiden
es: Cortar
fr: Découper
hi: कट आउट
it: Taglia
jp: 切り取り
lt: Iškirpti
ro: Decupați
ru: Вырезать
sv: Klipp ut
tr: Kesip çıkarın
zh: 剪切

# tformmain.menuitemcutcode.caption
source: Wytnij
ar: قطع
de: Ausschneiden
es: Cortar
fr: Découper
hi: कट आउट
it: Taglia
jp: 切り取り
lt: Iškirpti
ro: Decupați
ru: Вырезать
sv: Klipp ut
tr: Kesip çıkarın
zh: 剪切

source: Usuń kod
ar: إزالة الكود
de: Code löschen
es: Eliminar código
fr: Supprimer le code
hi: कोड हटाएं
it: Elimina codice
jp: コード削除
lt: Ištrinti kodą
ro: Ștergeți codul
ru: Удалить код
sv: Radera kod
tr: Kodu sil
zh: 删除代码

source: Usuń kod
ar: إزالة الكود
de: Code löschen
es: Eliminar código
fr: Supprimer le code
hi: कोड हटाएं
it: Elimina codice
jp: コード削除
lt: Ištrinti kodą
ro: Ștergeți codul
ru: Удалить код
sv: Radera kod
tr: Kodu sil
zh: 删除代码

# tformmain.menuitemdeletememologs.caption
source: Usuń
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
hi: मिटाना
it: Elimina
jp: 削除
lt: Ištrinti
ro: Ștergeți
ru: Удалить
sv: Radera
tr: Silme
zh: 删除

source: Dokumentacja online
ar: الوثائق الإلكترونية
de: Online-Dokumentation
es: Documentación en línea
fr: Documentation en ligne
hi: ऑनलाइन दस्तावेज़ीकरण
it: Documentazione online
jp: オンライン・ドキュメント
lt: Internetiniai dokumentai
ro: Documentație online
ru: Онлайн-документация
sv: Dokumentation online
tr: Çevrimiçi dokümantasyon
zh: 在线文档

# tformmain.menuitemoutputcodeclear.caption
source: Usuń
ar: حذفحذف
de: Löschen
es: Eliminar
fr: Supprimer
hi: मिटाना
it: Elimina
jp: 削除
lt: Ištrinti
ro: Ștergeți
ru: Удалить
sv: Radera
zh: 删除

# tformmain.menuitempaste.caption
source: Wklej
ar: لصق
de: Einfügen
es: Pegar
fr: Coller
hi: पेस्ट करें
it: Incolla
jp: ペースト
lt: Įklijuoti
ro: Lipiți
ru: Вставить
sv: Klistra in
tr: Yapıştır
zh: 粘贴

# tformmain.menuitempastecode.caption
source: Wklej
ar: لصق
de: Einfügen
es: Pegar
fr: Coller
hi: पेस्ट करें
it: Incolla
jp: ペースト
lt: Įklijuoti
ro: Lipiți
ru: Вставить
sv: Klistra in
tr: Yapıştır
zh: 粘贴

# tformmain.menuitemsavefile.caption
source: Zapisz
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
hi: बचाना
it: Salva
jp: セーブ
lt: Išsaugoti
ro: Salvați
ru: Сохранить
sv: Spara
tr: Kaydet
zh: 保存

source: Wesprzyj
ar: الدعم
de: Unterstützen Sie uns
es: Apoya
fr: Soutenez-nous
hi: सहायता
it: Sostieni
jp: サポート
lt: Pagalba
ro: Sprijin
ru: Поддержите
sv: Stöd
tr: Destek
zh: 支持

source: Nowy
ar: جديد
de: Neu
es: Nuevo
fr: Nouveau
hi: नया
it: Nuovo
jp: 新しい
lt: Naujas
ro: Nou
ru: Новый
sv: Ny
tr: Yeni
zh: 新的

source: Opcje projektu
ar: خيارات التصميم
de: Projektoptionen
es: Opciones de diseño
fr: Options de conception
hi: डिज़ाइन विकल्प
it: Opzioni di progetto
jp: 設計オプション
lt: Dizaino parinktys
ro: Opțiuni de proiectare
ru: Варианты проекта
sv: Designalternativ
tr: Tasarım seçenekleri
zh: 项目选项

source: Otwórz
ar: فتح
de: Öffnen
es: Abrir
fr: Ouvrir
hi: खुला
it: Apri
jp: オープン
lt: Atviras
ro: Deschis
ru: Открыть
sv: Öppna
tr: Açık
zh: 打开

source: Projekt
ar: المشروع
es: Proyecto
fr: Projet
hi: डिज़ाइन
it: Progetto
jp: プロジェクト
lt: Projektas
ro: Proiect
ru: Проект
tr: Proje
zh: 项目

source: Zapisz jak
ar: اكتب كيف
de: Speichern Sie wie
es: Guarda cómo
fr: Enregistrer comme
hi: के रूप रक्षित करें
it: Scrivi come
jp: どのように
lt: Užrašykite, kaip
ro: Scrieți cum
ru: Запишите как
sv: Skriv ner hur
tr: Nasıl olduğunu yazın
zh: 保存为

# tformmain.menuustawinia.caption
source: Settings
ru: Настройки

source: Nowy Plik
ar: ملف جديد
de: Neue Datei
es: Nuevo archivo
fr: Nouveau fichier
hi: नई फ़ाइल
it: Nuovo file
jp: 新規ファイル
lt: Naujas failas
ro: Fișier nou
ru: Новый файл
sv: Ny fil
tr: Yeni Dosya
zh: 新文件

# tformmain.toolbutton1.hint
source: Transpiluj
ar: الترجمة
es: Transpilar
fr: Transpiler
hi: ट्रांसपाइल
jp: トランスパイル
lt: Transpile
ro: Transpile
ru: Перевод
sv: Transpile
tr: Transpile
zh: 转录

# tformmain.transpiluj.caption
source: Transpiluj
ar: الترجمة
es: Transpilar
fr: Transpiler
hi: ट्रांसपाइल
it: Transpila
jp: トランスパイル
lt: Transpile
ro: Transpile
ru: Перевод
sv: Transpile
tr: Transpile
zh: 转录

source: Project Options
ru: Варианты проекта

# tformopcjeprojektu.sbok.caption
source: Ok
ar: Okحسناً
jp: オッケー
lt: Gerai
ru: Ок
tr: Tamam

# tformoprogramie.caption
source: O programie
de: Über das Programm
es: Acerca del programa
fr: À propos du programme
hi: कार्यक्रम के बारे में
it: Il programma
jp: プログラムについて
lt: Apie programą
ro: Despre program
ru: О программе
sv: Om programmet
tr: Program hakkında
zh: 关于该计划

# tformoprogramie.speedbutton1.caption
source: Ok
ar: حسناً
hi: ठीक है
jp: オッケー
lt: Gerai
ru: Ок
tr: Tamam

source: Application examples
ru: Примеры приложений

# tformprzyklady.speedbutton1.caption
source: Ok
ar: حسناً
hi: ठीक है
jp: オッケー
lt: Gerai
ru: Ок
tr: Tamam

# tformsettingintepreter.bitbtn1.caption
source: Ok
ar: حسناً
hi: ठीक है
jp: オッケー
lt: Gerai
ru: Ок
tr: Tamam.

# tformsettingintepreter.caption
source: Settings
ru: Настройки

source: Platform
ru: Платформа

source: Link to fpc.exe
ru: Путь к fpc.exe

source: Link to FPC folder
ru: Путь к папке FPC

source: Ustawienia Pomocnika AI
ar: إعدادات مساعد الذكاء الاصطناعي
de: Einstellungen des KI-Assistenten
es: Configuración del asistente AI
fr: Paramètres de l'assistant IA
hi: AI हेल्पर सेटिंग्स
it: Impostazioni dell'Assistente AI
jp: AIヘルパーの設定
lt: AI pagalbininko nustatymai
ro: Setări AI helper
ru: Настройки помощника AI
sv: Inställningar för AI-hjälpare
tr: Yapay zeka yardımcı ayarları
zh: AI助手设置

source: Model językowy
ar: نموذج اللغة
de: Sprachmodell
es: Modelo lingüístico
fr: Modèle linguistique
hi: भाषा मॉडल
it: Modello linguistico
jp: 言語モデル
lt: Kalbos modelis
ro: Model lingvistic
ru: Языковая модель
sv: Språkmodell
tr: Dil modeli
zh: 语言模型

source: Klucz API
ar: مفتاح API
de: API-Schlüssel
es: Clave API
fr: Clé API
hi: API कुंजी
it: Chiave API
jp: APIキー
lt: API raktas
ro: Cheie API
ru: API-ключ
sv: API-nyckel
tr: API anahtarı
zh: API密钥

# tsettingai.menuitemcopy.caption
source: Kopiuj
ar: نسخ
de: Kopieren
es: Copiar
fr: Copier
hi: प्रतिलिपि
it: Chiave API
jp: コピー
lt: Kopijuoti
ro: Copiați
ru: Копировать
sv: Kopia
tr: Anlaşıldı
zh: 复制

# tsettingai.menuitemdelete.caption
source: Usuń
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
hi: मिटाना
it: Elimina
jp: 削除
lt: Ištrinti
ro: Ștergeți
ru: Удалить
sv: Radera
tr: Silme
zh: 删除

source: Ukryj klucz
ar: إخفاء المفتاح
de: Schlüssel ausblenden
es: Ocultar clave
fr: Masquer la clé
hi: कुंजी छिपाएँ
it: Nascondi chiave
jp: キーを隠す
lt: Paslėpti raktą
ro: Ascundeți cheia
ru: Скрыть ключ
sv: Dölj nyckeln
tr: Anahtarı gizleyin
zh: 隐藏密钥

source: Wstaw
ar: إدراج
de: Einfügen
es: Insertar
fr: Insérer
hi: डालना
it: Inserisci
jp: 挿入
lt: Įdėkite
ro: Introduceți
ru: Вставить
sv: Insättning
tr: Ekleme
zh: 插入

source: Pokaż klucz
ar: عرض المفتاح
de: Schlüssel anzeigen
es: Mostrar clave
fr: Afficher la clé
hi: कुंजी दिखाएँ
it: Mostra chiave
jp: キーを表示
lt: Rodyti raktą
ro: Afișați tasta
ru: Показать ключ
sv: Visa tangent
tr: Anahtarı göster
zh: 显示密钥

# tsettingai.speedbutsave.caption
source: Zapisz
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
jp: セーブ
lt: Išsaugoti
ro: Salvați
ru: Сохранить
sv: Spara
tr: Kaydet
zh: 保存

source: Anuluj
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
hi: रद्द करना
it: Annulla
jp: 発表
lt: Annouce
ro: Anulează
ru: Отменить
sv: Tillkännagivande
tr: Duyuru
zh: 取消

# tsettingtheme.btnsave.caption
source: Save
ru: Сохранить

source: Theme Settings
ru: Настройки темы

# tsettingtheme.groupbox1.caption
source: Theme
ru: Тема

# tsettingtheme.speedbutton1.caption
source: Ok
ru: ОК

source: Wsparcie
ar: الدعم
de: Unterstützung
es: Apoyo
fr: Assistance
hi: सहायता
it: Assistenza
jp: サポート
lt: Parama
ro: Sprijin
ru: Поддержка
sv: Stöd
tr: Destek
zh: 支持

# twsparcie.speedbutton1.caption
source: OK
ar: حسناً
hi: ठीक है
jp: オッケー
lt: GERAI
ru: Ок
tr: TAMAM.

source: Wesprzyj projekt
ar: دعم المشروع
de: Unterstützen Sie das Projekt
es: Apoya el proyecto
fr: Soutenez le projet
hi: परियोजना का समर्थन करें
it: Sostieni il progetto
jp: プロジェクトを支援する
lt: Parama projektui
ro: Susțineți proiectul
ru: Поддержите проект
sv: Stödja projektet
tr: Projeyi destekleyin
zh: 支持该项目

# unit1.countchars
source: Signs
ru: Знаки

# unit1.countline
source: Lines of Code
ru: Линии кода

source: Enter the name of the program:
ru: Укажите название программы:

source: New file
ru: Новый файл

source: Open project:
ru: Открытый проект:

source: - Added custom IDE modules path:
ru: - Добавлен путь к пользовательским модулям IDE:

source: - Added user modules path:
ru: - Добавлен путь к пользовательским модулям:

source: AI Helper API Key Added
ru: Добавлен ключ API AI Helper

source: AI Helper Model:
ru: Модель помощника ИИ:

source: Answer!
ru: Ответ!

source: Attention!
ru: Внимание!

# unit1.translatechackexamplesfolderexists
source: Check that the "examples" folder exists and contains the appropriate files.
ru: Проверьте, существует ли папка «examples» и содержит ли она необходимые файлы.

source: Check API token and internet connection
ru: Проверьте API-токен и подключение к Интернету

source: Checking the IDE s own modules directory:
ru: Проверка каталога собственных модулей IDE:

# unit1.translatecomilationsuccessoutputfile
source: Compilation successful! Output file:
ru: Компиляция прошла успешно! Выходной файл:

# unit1.translatecompilationsuccses
source: Compilation successful! Output file:
ru: Компиляция прошла успешно! Выходной файл:

source: Compiler settings loaded
ru: Настройки компилятора загружены

source: Compiling in Debug mode...
ru: Компиляция в режиме отладки...

source: Compiling in Release mode.
ru: Компиляция в режиме Release.

source: CONFIGURATION ERROR: The configured FPC base path (FpcBasePath) does not exist:
ru: ОШИБКА КОНФИГУРАЦИИ: Настроенный базовый путь FPC (FpcBasePath) не существует:

source: CONFIGURATION ERROR: no module path set
ru: ОШИБКА КОНФИГУРАЦИИ: не задан путь к модулю

source: CONFIGURATION ERROR: Target platform not set in
ru: ОШИБКА КОНФИГУРАЦИИ: целевая платформа не установлена

source: Info: IDE custom modules directory not found:
ru: Информация: каталог пользовательских модулей IDE не найден:

source: Editor font size loaded:
ru: Размер шрифта редактора загружен:

source: Editor font size not loaded:
ru: Размер шрифта редактора не загружен:

source: Please enter your question!
ru: Пожалуйста, введите Ваш вопрос!

source: Compilation error:
ru: Ошибка компиляции:

source: Compilation error. Code:
ru: Ошибка компиляции. Код:

source: Error: Empty response received
ru: Ошибка: получен пустой ответ

source: FATAL ERROR: The FPC base path (FpcBasePath) is not configured correctly or does not exist!
ru: ФАТАЛЬНАЯ ОШИБКА: Базовый путь FPC (FpcBasePath) настроен неправильно или не существует!

# unit1.translateerroccurred
source: An error occurred:
ru: Произошла ошибка:

source: Error: No Pascal code to compile (PascalCode parameter is empty).
ru: Ошибка: нет кода Pascal для компиляции (параметр PascalCode пуст).

source: FATAL ERROR: The path to the FPC compiler (FpcPath) is not configured correctly!
ru: ФАТАЛЬНАЯ ОШИБКА: Путь к компилятору FPC (FpcPath) настроен неправильно!

source: ERROR: Required FPC standard unit directory not found:
ru: ОШИБКА: требуемый каталог стандартных модулей FPC не найден:

source: WARNING: Configured user modules path (FModulsPath:
ru: ВНИМАНИЕ: Настроенный путь к пользовательским модулям (FModulsPath:

source: Failed to start program:
ru: Не удалось запустить программу:

# unit1.translatefiledoesnotexist
source: File does not exist:
ru: Файл не существует:

source: File not saved. Compilation canceled.
ru: Файл не сохранён. Компиляция отменена.

source: Project not saved. Build canceled.
ru: Проект не сохранён. Сборка отменена.

source: FATAL ERROR: The path to the FPC compiler does not exist or is not set in
ru: ФАТАЛЬНАЯ ОШИБКА: Путь к компилятору FPC не существует или не указан в

source: CONFIGURATION ERROR: Base path to FPC compiler folder is not set in
ru: ОШИБКА КОНФИГУРАЦИИ: Базовый путь к папке компилятора FPC не задан в

source: - Info: IDE modules path is same as user modules, skipping duplicate.
ru: - Информация: путь к модулям IDE такой же, как и к пользовательским модулям, дубликаты пропускаются.

source: Empty item selected.
ru: Выбран пустой элемент.

source: Link to fpc.exe compiler:
ru: Ссылка на компилятор fpc.exe:

source: Link to compiler folder:
ru: Ссылка на папку компилятора:

source: Loading settings
ru: Загрузка настроек

source: Mistake
ru: Ошибка

source: Modules:
ru: Модули:

source: No item selected.
ru: Элемент не выбран.

source: ) does not exist!
ru: ) не существует!

source: No token from AI Assistant
ru: Нет токена от ИИ Помощника

source: Platform:
ru: Платформа:

source: Project not saved. Save project before compiling?
ru: Проект не сохранён. Сохранить проект перед компиляцией?

source: .Standard FPC units will not be found!
ru: Стандартные блоки FPC не будут найдены!

source: Starting compilation...
ru: Начинаю компиляцию...

source: Starting compilation with parameters:
ru: Запуск компиляции с параметрами:

source: NOTE: SynEditCode not created!
ru: ПРИМЕЧАНИЕ: SynEditCode не создан!

source: Translation Error:
ru: Ошибка перевода:

source: .Unable to determine unit directory!
ru: Невозможно определить каталог объекта!

# uprzyklady.translateanerroroccurred
source: An error occurred:
ru: Произошла ошибка:

# uprzyklady.translatecheckexamples
source: Check that the "examples" folder exists and contains the appropriate files.
ru: Проверьте, существует ли папка «examples» и содержит ли она необходимые файлы.

source: "does not exist!"
ru: "не существует!"

source: Empty item selected
ru: Выбран пустой элемент

source: Error: Folder "
ru: Ошибка: Папка "

source: Error: The FuSettingsChatGPT object is not available.
ru: Ошибка: объект FuSettingsChatGPT недоступен.

# uprzyklady.translatefilenotexist
source: File does not exist:
ru: Файл не существует:

source: No item selected
ru: Элемент не выбран

source: Błędna składnia funkcji wstaw. Oczekiwano: wstaw(source, target, index)
ar: بناء جملة غير صحيح لوظيفة الإدراج. المتوقع: insert(source, target, index)
de: Fehlerhafte Syntax der Funktion insert. Erwartet wurde: insert(source, target, index)
fr: Syntaxe incorrecte de la fonction insert. Attendu : insert(source, target, index)
hi: insert फ़ंक्शन का सिंटैक्स ग़लत है। अपेक्षित: insert(source, target, index)
it: Sintassi errata della funzione insert. Risultato atteso: insert(source, target, index)
jp: insert 関数の構文が正しくありません。期待値： insert(source, target, index)
lt: Netinkama įterpimo funkcijos sintaksė. Laukiama: insert(source, target, index)
ro: Sintaxă incorectă a funcției insert. Se așteaptă: insert(sursă, țintă, index)
sv: Felaktig syntax för funktionen insert. Förväntat: insert(källa, mål, index)
tr: insert fonksiyonunun sözdizimi hatalı. Beklenen: insert(kaynak, hedef, dizin)
zh: 插入函数的语法错误。预期为：insert(source, target, index)

source: Funkcja wstaw wymaga trzech argumentów: source, target, index
ar: تتطلب وظيفة الإدراج ثلاثة معاملات: المصدر والهدف والفهرس.
de: Die Funktion insert benötigt drei Argumente: source, target, index
fr: La fonction insert nécessite trois arguments : source, target, index
hi: इन्सर्ट फ़ंक्शन के लिए तीन तर्कों की आवश्यकता होती है: स्रोत, लक्ष्य, सूचकांक
it: La funzione insert richiede tre argomenti: source, target, index
jp: insert関数は、ソース、ターゲット、インデックスの3つの引数を必要とします。
lt: Įterpimo funkcijai reikalingi trys argumentai: šaltinis, tikslas, indeksas.
ro: Funcția insert necesită trei argumente: sursă, țintă, index
sv: Funktionen insert kräver tre argument: källa, mål, index
tr: Ekleme işlevi üç bağımsız değişken gerektirir: kaynak, hedef, dizin
zh: 插入函数需要三个参数：源、目标、索引

source: Błędna składnia funkcji przytnij. Oczekiwano: przytnij(s)
ar: بناء جملة غير صحيح لوظيفة trim. المتوقع: trim(s)
de: Fehlerhafte Syntax der Funktion trim. Erwartet wurde: trim(s)
fr: Syntaxe incorrecte de la fonction trim. Attendu : trim(s)
hi: ट्रिम फ़ंक्शन के लिए अमान्य सिंटैक्स। अपेक्षित: ट्रिम(s)
it: Sintassi errata della funzione trim. Risultato atteso: trim(s)
jp: trim 関数の構文が正しくありません。期待値：trim(s)
lt: Neteisingas funkcijos "trim" sintaksės nustatymas. Laukiama: trim(s)
ro: Sintaxă incorectă a funcției trim. Se așteaptă: trim(s)
sv: Felaktig syntax för trim-funktionen. Förväntat: trim(s)
tr: Trim fonksiyonunun sözdizimi hatalı. Beklenen: trim(s)
zh: trim函数语法错误。预期为：trim(s)

source: Błędna składnia funkcji przytnij_z_lewa. Oczekiwano: przytnij_z_lewa(s)
ar: بناء جملة غير صحيح للدالة trim_from_left. المتوقع: trim_from_left(s)
de: Falsche Syntax der Funktion trim_left. Erwartet wurde: trim_left(s)
fr: Syntaxe incorrecte de la fonction trim_left. Attendu : trim_left(s)
hi: trim_left फ़ंक्शन के लिए गलत सिंटैक्स। अपेक्षित: trim_left(s)
it: Sintassi errata della funzione trim_left. Risultato atteso: trim_left(s)
jp: 関数 trim_with_left の構文が正しくありません。期待値：trim_from_left(s)
lt: Neteisingas funkcijos trim_with_left sintaksė. Laukiama: trim_from_left(s)
ro: Sintaxă incorectă a funcției trim_with_left. Se așteaptă: trim_from_left(s)
sv: Felaktig syntax för funktionen trim_with_left. Förväntat: trim_from_left(s)
tr: trim_with_left işlevinin sözdizimi hatalı. Beklenen: trim_from_left(s)
zh: trim_left 函数的语法错误。预期为：trim_left(s)
