Repository: Programista-Art/Avocado
Catalog: languages/IDE Avocado.*.po
Languages: ar, de, es, fr, hi, it, jp, lt, ro, ru, sv, tr, zh

source: Błędna składnia funkcji przytnij_z_prawa. Oczekiwano: przytnij_z_prawa(s)
ar: بناء جملة غير صحيح لوظيفة trim_from_right. المتوقع: trim_from_right(s)
de: Falsche Syntax der Funktion trim_right. Erwartet wurde: trim_right.(s)
fr: Syntaxe incorrecte de la fonction trim_right. Attendu : trim_right(s)
hi: trim_right फ़ंक्शन के लिए गलत सिंटैक्स। अपेक्षित: trim_right(s)
it: Sintassi errata della funzione trim_right. Risultato atteso: trim_right(s)
jp: 関数 trim_with_right の構文が正しくない。期待値：trim_from_right(s)
lt: Neteisingas funkcijos trim_with_right sintaksė. Laukiama: trim_from_right(s)
ro: Sintaxă incorectă a funcției trim_with_right. Se așteaptă: trim_from_right(s)
sv: Felaktig syntax för funktionen trim_with_right. Förväntat: trim_from_right(s)
tr: trim_with_right işlevinin sözdizimi hatalı. Beklenen: trim_from_right(s)
zh: trim_right 函数的语法错误。预期为：trim_right(s)

source: Nieprawidłowa deklaracja zmiennej:
ar: إعلان متغير غير صحيح:
de: Ungültige Variablendeklaration:
es: Declaración de variable no válida:
fr: Déclaration de variable non valide :
hi: अमान्य चर घोषणा:
it: Dichiarazione di variabile non valida:
jp: 変数の宣言が正しくない：
lt: Neteisingas kintamojo deklaravimas:
ro: Declararea incorectă a unei variabile:
sv: Felaktig deklaration av en variabel:
tr: Bir değişkenin yanlış bildirilmesi:
zh: 变量声明错误：

source: Informacja o IDE Avocado
ar: معلومات عن IDE Avocado
de: Informationen zu IDE Avocado
es: Información sobre IDE Avocado
fr: Informations sur l'IDE Avocado
hi: एवोकाडो आईडीई के बारे में जानकारी
it: Informazioni su IDE Avocado
jp: アボカドIDEに関する情報
lt: Informacija apie avokadų IDE
ro: Informații privind Avocado IDE
sv: Information om avokado IDE
tr: Avokado IDE Hakkında Bilgi
zh: 关于IDE Avocado的信息

# tformautor.caption
source: Autor
ar: المؤلف
fr: Auteur
hi: लेखक
it: Autore
jp: 著者
lt: Autorius
sv: Författaren
zh: 作者

source: Pomocnik AI
ar: مساعد الذكاء الاصطناعي
de: AI-Assistent
es: Asistente de IA
fr: Assistant IA
hi: एआई हेल्पर
it: Assistente AI
jp: AIヘルパー
lt: AI pagalbininkas
ro: Ajutor AI
sv: AI-hjälpare
tr: Yapay zeka yardımcısı
zh: AI助手

source: Wpisz zapytanie
ar: أدخل استفسارك
de: Geben Sie Ihre Suchanfrage ein
es: Ingrese su consulta
fr: Entrez votre requête
hi: अपना प्रश्न दर्ज करें
it: Inserisci la tua richiesta
jp: クエリを入力
lt: Įveskite užklausą
ro: Introduceți interogarea dvs.
sv: Ange din fråga
tr: Sorgunuzu girin
zh: 输入查询

source: Informacja
ar: معلومات
de: Information
es: Información
fr: Information
hi: जानकारी
it: Informazioni
jp: インフォメーション
lt: Informacija
ro: Informații
sv: Information om
tr: Bilgi
zh: 信息

# tformmain.menuitem2.caption
source: Ustawienia
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
hi: सेटिंग्स
it: Impostazioni
jp: 設定
lt: Nustatymai
ro: Setări
sv: Inställningar
tr: Ayarlar
zh: 设置

source: Ustawienia pomocnika AI
ar: إعدادات المساعد الذكي
de: AI-Assistent-Einstellungen
es: Configuración del asistente AI
fr: Paramètres de l'assistant IA
hi: AI हेल्पर सेटिंग्स
it: Impostazioni assistente AI
jp: AIヘルパーの設定
lt: AI pagalbininko nustatymai
ro: Setări AI helper
sv: Inställningar för AI-hjälpare
tr: Yapay zeka yardımcı ayarları
zh: AI助手设置

# tformmain.menuustawinia.caption
source: Ustawienia
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
hi: सेटिंग्स
it: Impostazioni
jp: 設定
lt: Nustatymai
ro: Setări
sv: Inställningar
tr: Ayarlar
zh: 设置

source: NowyPLik
ar: ملف جديد
hi: नई फ़ाइल
jp: ニュープリック

source: Transpilacja do Free Pascal
ar: التحويل إلى Free Pascal
de: Transpilation nach Free Pascal
es: Transpilación a Free Pascal
fr: Transpilation vers Free Pascal
hi: मुक्त पास्कल में ट्रांसपिलेशन
it: Trascrizione in Free Pascal
jp: フリー・パスカルへの変換
lt: Perkėlimas į "Free Pascal
ro: Transpilarea către Free Pascal
sv: Transpilering till Free Pascal
tr: Serbest Pascal'a aktarım
zh: 转译为Free Pascal

source: Kompiluj i zapisz
ar: تجميع وحفظ
de: Kompilieren und speichern
es: Compilar y guardar
fr: Compiler et enregistrer
hi: संकलित करें और सहेजें
it: Compila e salva
jp: コンパイルと保存
lt: Surinkti ir išsaugoti
ro: Compilați și salvați
sv: Kompilera och spara
tr: Derleyin ve kaydedin
zh: 编译并保存

# tformmain.toolbutton2.hint
source: Kompiluj
ar: تجميع
de: Kompilieren
es: Compilar
fr: Compiler
hi: संकलन
it: Compila
jp: コンパイル
lt: Surinkti
ro: Compilați
sv: Kompilera
tr: Derleme
zh: 编译

source: Opcje Projektu
ar: خيارات المشروع
de: Projektoptionen
es: Opciones del proyecto
fr: Options du projet
hi: परियोजना विकल्प
it: Opzioni del progetto
jp: プロジェクト・オプション
lt: Projekto galimybės
ro: Opțiuni de proiect
sv: Projektalternativ
tr: Proje seçenekleri
zh: 项目选项

source: Przyklady aplikacji
ar: أمثلة على التطبيقات
de: Anwendungsbeispiele
es: Ejemplos de aplicaciones
fr: Exemples d'applications
hi: अनुप्रयोग उदाहरण
it: Esempi di applicazioni
jp: 応用例
lt: Programų pavyzdžiai
ro: Exemple de aplicații
sv: Exempel på tillämpningar
tr: Uygulama örnekleri
zh: 应用示例

# tformsettingintepreter.caption
source: Ustawienia
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
hi: सेटिंग्स
it: Impostazioni
jp: 設定
lt: Nustatymai
ro: Setări
sv: Inställningar
tr: Ayarlar
zh: 设置

source: Platforma
de: Plattform
es: Plataforma
fr: Plateforme
hi: प्लैटफ़ॉर्म
it: Piattaforma
jp: プラットフォーム
ro: Platformă
sv: Plattform
tr: Platform
zh: 平台

source: LInk do fpc.exe
ar: رابط إلى fpc.exe
es: Enlace a fpc.exe
hi: fpc.exe से लिंक करें
jp: fpc.exe リンク
lt: fpc.exe nuoroda
ro: Link către fpc.exe
sv: fpc.exe länk
tr: fpc.exe bağlantısı
zh: fpc.exe 的链接

source: Link do folderu FPC
ar: رابط إلى مجلد FPC
de: Link zum FPC-Ordner
es: Enlace a la carpeta FPC
fr: Lien vers le dossier FPC
hi: FPC फ़ोल्डर से लिंक करें
it: Link alla cartella FPC
jp: FPCフォルダへのリンク
lt: Nuoroda į aplanką FPC
ro: Link către folderul FPC
sv: Länk till mappen FPC
tr: Bağlantı do folderu FPC
zh: FPC文件夹链接

source: Znaków
jp: 看板
lt: Ženklai
ro: Semne
sv: Skyltar
tr: İşaretler

source: Linii Kodu
jp: コード行
lt: Kodo eilutės
ro: Linii de cod
sv: Kodrader
tr: Kod satırları

source: Podaj nazwę programu:
ar: أدخل اسم البرنامج:
de: Geben Sie den Namen des Programms an:
es: Introduzca el nombre del programa:
fr: Entrez le nom du programme :
hi: प्रोग्राम का नाम दर्ज करें:
it: Inserisci il nome del programma:
jp: 番組名を入力してください：
lt: Įveskite programos pavadinimą:
ro: Introduceți numele programului:
sv: Ange namnet på programmet:
tr: Programın adını girin:
zh: 请输入程序名称：

source: Nowy plik
ar: ملف جديد
de: Neue Datei
es: Nuevo archivo
fr: Nouveau fichier
hi: नई फ़ाइल
it: Nuovo file
jp: 新規ファイル
lt: Naujas failas
ro: Fișier nou
sv: Ny fil
tr: Yeni dosya
zh: 新文件

source: Otwarty projekt:
ar: مشروع مفتوح:
de: Offenes Projekt:
fr: Projet ouvert :
it: Progetto aperto:
jp: オープンプロジェクト：
lt: Atviras projektas:
ro: Proiect deschis:
sv: Öppet projekt:
tr: Açık proje:
zh: 打开项目：

source: ZapiszPlik
lt: SaveFile

# unit1.countchars
source: Znaków
ar: الشخصيات
de: Zeichen
fr: Signes
it: Segni
zh: 症状

# unit1.countline
source: Linii Kodu
ar: سطور من التعليمات البرمجية
de: Code Line
fr: Lignes de code
it: Linee di codice
zh: 代码行数

source: Polski
hi: पोलिश
ro: poloneză

source: Linii kodu
es: Líneas de código
hi: कोड की पंक्तियाँ

source: Indonesia
sv: Indonesien
